Revit 2026 API

# ImageExportOptionsFilePath Property

---

The file name and path for the exported file.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string FilePath { get; set; }
```
```vb
Public Property FilePath As String
	Get
	Set
```
```cpp
public:
property String^ FilePath {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member FilePath : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The input file path is not valid. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

If ExportRange is SetOfViews, the name of each view or sheet will be appended to the name provided for each exported file. This field is ignored if used to save an image to a project as a new view.

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace